       IDENTIFICATION DIVISION.
       AUTHOR.        CarlosRobertodeSouza.
       DATE-WRITTEN.  03/02/2021.
       SECURITY.      *************************************************
                      * Describe the objectives of this program       *
                      *                                               *
                      * [F3] - Leave edit                             *
                      * QQ   - Leave the edit discarding the changes  *
                      * FF   - Leave the edit saving changes          *
                      *************************************************
                      *                               DESKTOP-FME2TME *
                      *     Microsoft Windows [vers∆o 10.0.19041.746] *
                      *************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       LINKAGE SECTION.

       SCREEN SECTION.

       PROCEDURE DIVISION.

       BEGIN.

           GOBACK.

