000000 77 SC5LDIS1-LAYOUT       PIC X(4).
000000 77 SC5LDIS1-SECTION-PGM  PIC X(32).
000000 77 SC5LDIS1-COD-MSG      PIC X(4).
000000 77 SC5LDIS1-QSAM-MSG     PIC X(60).
000000 77 SC5LDIS1-AREAMSG      PIC X(9).
000000 77 SC5LDIS1-PGM          PIC X(8).
