       01  BINARIOS.
           02 PIC X(32) VALUE "00000000000000010000001000000011".
           02 PIC X(32) VALUE "00000100000001010000011000000111".
           02 PIC X(32) VALUE "00001000000010010000101000001011".
           02 PIC X(32) VALUE "00001100000011010000111000001111".
           02 PIC X(32) VALUE "00010000000100010001001000010011".
           02 PIC X(32) VALUE "00010100000101010001011000010111".
           02 PIC X(32) VALUE "00011000000110010001101000011011".
           02 PIC X(32) VALUE "00011100000111010001111000011111".
           02 PIC X(32) VALUE "00100000001000010010001000100011".
           02 PIC X(32) VALUE "00100100001001010010011000100111".
           02 PIC X(32) VALUE "00101000001010010010101000101011".
           02 PIC X(32) VALUE "00101100001011010010111000101111".
           02 PIC X(32) VALUE "00110000001100010011001000110011".
           02 PIC X(32) VALUE "00110100001101010011011000110111".
           02 PIC X(32) VALUE "00111000001110010011101000111011".
           02 PIC X(32) VALUE "00111100001111010011111000111111".
           02 PIC X(32) VALUE "01000000010000010100001001000011".
           02 PIC X(32) VALUE "01000100010001010100011001000111".
           02 PIC X(32) VALUE "01001000010010010100101001001011".
           02 PIC X(32) VALUE "01001100010011010100111001001111".
           02 PIC X(32) VALUE "01010000010100010101001001010011".
           02 PIC X(32) VALUE "01010100010101010101011001010111".
           02 PIC X(32) VALUE "01011000010110010101101001011011".
           02 PIC X(32) VALUE "01011100010111010101111001011111".
           02 PIC X(32) VALUE "01100000011000010110001001100011".
           02 PIC X(32) VALUE "01100100011001010110011001100111".
           02 PIC X(32) VALUE "01101000011010010110101001101011".
           02 PIC X(32) VALUE "01101100011011010110111001101111".
           02 PIC X(32) VALUE "01110000011100010111001001110011".
           02 PIC X(32) VALUE "01110100011101010111011001110111".
           02 PIC X(32) VALUE "01111000011110010111101001111011".
           02 PIC X(32) VALUE "01111100011111010111111001111111".
           02 PIC X(32) VALUE "10000000100000011000001010000011".
           02 PIC X(32) VALUE "10000100100001011000011010000111".
           02 PIC X(32) VALUE "10001000100010011000101010001011".
           02 PIC X(32) VALUE "10001100100011011000111010001111".
           02 PIC X(32) VALUE "10010000100100011001001010010011".
           02 PIC X(32) VALUE "10010100100101011001011010010111".
           02 PIC X(32) VALUE "10011000100110011001101010011011".
           02 PIC X(32) VALUE "10011100100111011001111010011111".
           02 PIC X(32) VALUE "10100000101000011010001010100011".
           02 PIC X(32) VALUE "10100100101001011010011010100111".
           02 PIC X(32) VALUE "10101000101010011010101010101011".
           02 PIC X(32) VALUE "10101100101011011010111010101111".
           02 PIC X(32) VALUE "10110000101100011011001010110011".
           02 PIC X(32) VALUE "10110100101101011011011010110111".
           02 PIC X(32) VALUE "10111000101110011011101010111011".
           02 PIC X(32) VALUE "10111100101111011011111010111111".
           02 PIC X(32) VALUE "11000000110000011100001011000011".
           02 PIC X(32) VALUE "11000100110001011100011011000111".
           02 PIC X(32) VALUE "11001000110010011100101011001011".
           02 PIC X(32) VALUE "11001100110011011100111011001111".
           02 PIC X(32) VALUE "11010000110100011101001011010011".
           02 PIC X(32) VALUE "11010100110101011101011011010111".
           02 PIC X(32) VALUE "11011000110110011101101011011011".
           02 PIC X(32) VALUE "11011100110111011101111011011111".
           02 PIC X(32) VALUE "11100000111000011110001011100011".
           02 PIC X(32) VALUE "11100100111001011110011011100111".
           02 PIC X(32) VALUE "11101000111010011110101011101011".
           02 PIC X(32) VALUE "11101100111011011110111011101111".
           02 PIC X(32) VALUE "11110000111100011111001011110011".
           02 PIC X(32) VALUE "11110100111101011111011011110111".
           02 PIC X(32) VALUE "11111000111110011111101011111011".
           02 PIC X(32) VALUE "11111100111111011111111011111111".
       01  REDEFINES BINARIOS.
           05 BINARIO PIC X(8) OCCURS 256.
