           EVALUATE CLIC-LINHA
              WHEN "CAB-05"
                   MOVE DIA-IM(4:2)                         TO C02L04
           END-EVALUATE
