           05 MINUSCULAS             PIC  X(049) VALUE
              "abcdefghijklmnopqrstuvwxyz ‚¡¢£ì…Š•—„‰”ƒˆŒ“–Æä‡".
           05 MAIUSCULAS             PIC  X(049) VALUE
              "ABCDEFGHIJKLMNOPQRSTUVWXYZµÖàéí·ÔëãëŽÓ™š¶Ò×âêÇå€".
           05 ACENTOS-850            PIC  X(058) VALUE
           "µÖàéí ‚¡¢£ì¶Ò×âêƒˆŒ“–·ÔÞãë…Š•—Çå¥Æä¤Ž™š„‰‹”€‡Ó§¦«ó¸©¨¯®".
           05 ACENTOS-437            PIC  X(058) VALUE
           "µÖàéí ‚¡¢£y¶Ò×âêƒˆŒ“–·ÔÞãë…Š•—Ž™¥„”¤Ž™š„‰‹”€‡Ó§¦«ó¸©¨¯®".
      *    "AIOUY ‚¡¢£yAEIOUƒˆŒ“–AEIOU…Š•—Ž™¥„”¤Ž™š„‰‹”€‡E".
           05 ACENTOS-WINDOWS        PIC  X(058) VALUE
           "ÁÉÍÓÚÝáéíóúýÂÊÎÔÛâêîôûÀÈÌÒÙàèìòùÃÕÑãõñÄÖÜäëïöüÇçËºª½¼©®¿»«".
           05 ACENTOS-OFF            PIC  X(058) VALUE
           "AEIOUYaeiouyAEUIUaeuiuAEIOUaeiouAONaonAOUaeiouCcE§¦«ó¸©¨¯®".

