       01  LOCK-MODE.
           04 pic 9. 88 Lock-on-multiple-records    value 1.
           04 pic 9. 88 WRITELOCK-directive-enabled value 1.
           04 pic 9. 88 RETRYOPEN-ON                value 1.
           04 pic 9. 88 SKIPLOCK-ON                 value 1.
           04 pic 9. 88 RETRYLOCK-ON                value 1.
           04 pic 9. 88 Lock-mode-MANUAL            value 1.
           04 pic 9. 88 Lock-mode-AUTOMATIC         value 1.
           04 pic 9. 88 Lock-mode-EXCLUSIVE         value 1.
