
       FD  PPT
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS LB-PPT.

       01  PPT-RECORD.
           05 PPT-PROGRAM         PIC X(08).
           05 PPT-GROUP           PIC X(08).
           05 PPT-DESCRIPTION     PIC X(50).
           05 PPT-LANGUAGE        PIC X(10).

