       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CWGTLD.
       AUTHOR.        COBOLware Services Ltda.
       DATE-WRITTEN.  15/05/2004.
       SECURITY.      *************************************************
                      *                                               *
                      *  Simula CBL_GET_SCR_LINE_DRAW                 *
                      *  Get line drawing characters                  *
                      *                                               *
                      *************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

       000-INICIO.
           MOVE 0 TO RETURN-CODE
           GOBACK.
       END PROGRAM CWGTLD.
