       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CWGTGR.
       AUTHOR.        COBOLware Services Ltda.
       DATE-WRITTEN.  15/05/2004.
       SECURITY.      *************************************************
                      *                                               *
                      * Simula CBL_GET_SCR_GRAPHICS                   *
                      * Get graphics characters                       *
                      *************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

           MOVE 0 TO RETURN-CODE
           GOBACK.

       END PROGRAM CWGTGR.
