       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CWMSMF.
       AUTHOR.        COBOLware Services Ltda.
       DATE-WRITTEN.  31/07/2004.
       SECURITY.      *************************************************
                      *                                               *
                      *  Converte codigos de teclas X"AF"             *
                      *  de Microsoft para Micro Focus                *
                      *                                               *
                      *************************************************

       DATA DIVISION.
       LINKAGE SECTION.

       01 KEY-STATUS.
          05 KEY-TYPE            PIC X.
          05 KEY-CODE-1          PIC 9(2) COMP-X.
          05 KEY-CODE-2          PIC 9(2) COMP-X.

       PROCEDURE DIVISION USING KEY-STATUS.

       000-INICIO.

           EVALUATE KEY-STATUS
               WHEN X"321901" MOVE X"321901" TO KEY-STATUS *> CTRL-A
               WHEN X"320C02" MOVE X"320C02" TO KEY-STATUS *> CTRL-B
               WHEN X"330303" MOVE X"390803" TO KEY-STATUS *> CTRL-C
               WHEN X"330404" MOVE X"390804" TO KEY-STATUS *> CTRL-D
               WHEN X"330505" MOVE X"390805" TO KEY-STATUS *> CTRL-E
               WHEN X"320D06" MOVE X"320D06" TO KEY-STATUS *> CTRL-F
               WHEN X"330707" MOVE X"390807" TO KEY-STATUS *> CTRL-G
               WHEN X"320E08" MOVE X"320E08" TO KEY-STATUS *> BACKSPAC
               WHEN X"320B09" MOVE X"320B09" TO KEY-STATUS *> TAB
               WHEN X"330A0A" MOVE X"39080A" TO KEY-STATUS *> CTRL-J
               WHEN X"32010B" MOVE X"32010B" TO KEY-STATUS *> CTRL-K
               WHEN X"330C0C" MOVE X"39080C" TO KEY-STATUS *> CTRL-L
               WHEN X"320B0D" MOVE X"32300D" TO KEY-STATUS *> ENTER
               WHEN X"330E0E" MOVE X"39080E" TO KEY-STATUS *> CTRL-N
               WHEN X"32100F" MOVE X"32100F" TO KEY-STATUS *> CTRL-O
               WHEN X"331010" MOVE X"390810" TO KEY-STATUS *> CTRL-P
               WHEN X"331111" MOVE X"390811" TO KEY-STATUS *> CTRL-Q
               WHEN X"321212" MOVE X"321212" TO KEY-STATUS *> CTRL-R
               WHEN X"331313" MOVE X"390813" TO KEY-STATUS *> CTRL-S
               WHEN X"331414" MOVE X"390814" TO KEY-STATUS *> CTRL-T
               WHEN X"331515" MOVE X"390815" TO KEY-STATUS *> CTRL-U
               WHEN X"331616" MOVE X"390816" TO KEY-STATUS *> CTRL-V
               WHEN X"331717" MOVE X"390817" TO KEY-STATUS *> CTRL-W
               WHEN X"321418" MOVE X"321418" TO KEY-STATUS *> CTRL-X
               WHEN X"320F19" MOVE X"320F19" TO KEY-STATUS *> CTRL-Y
               WHEN X"32131A" MOVE X"32131A" TO KEY-STATUS *> CTRL-Z
????  *        WHEN X"31001B" MOVE X"31001B" TO KEY-STATUS *> ESC
               WHEN X"31001B" MOVE X"310000" TO KEY-STATUS *> ESC
      *        WHEN X"000000" MOVE X"000000" TO KEY-STATUS *> FILLER
      *        WHEN X"000000" MOVE X"000000" TO KEY-STATUS *> FILLER
               WHEN X"331C1C" MOVE X"39081C" TO KEY-STATUS *> CTRL-BACKSLASH
               WHEN X"331D1D" MOVE X"39081D" TO KEY-STATUS *> CTRL-BRACKET
               WHEN X"331F1F" MOVE X"39081F" TO KEY-STATUS *> CTRL-MINUS
               WHEN X"332020" MOVE X"332020" TO KEY-STATUS *> SPACEBAR
Same  *        WHEN X"320C00" MOVE X"320C00" TO KEY-STATUS *> BACKTAB
               WHEN X"315100" MOVE X"315100" TO KEY-STATUS *> ALT-Q
               WHEN X"315700" MOVE X"315700" TO KEY-STATUS *> ALT-W
               WHEN X"314500" MOVE X"314500" TO KEY-STATUS *> ALT-E
               WHEN X"315200" MOVE X"315200" TO KEY-STATUS *> ALT-R
               WHEN X"315400" MOVE X"315400" TO KEY-STATUS *> ALT-T
               WHEN X"315900" MOVE X"315900" TO KEY-STATUS *> ALT-Y
               WHEN X"315500" MOVE X"315500" TO KEY-STATUS *> ALT-U
               WHEN X"314900" MOVE X"314900" TO KEY-STATUS *> ALT-I
               WHEN X"314F00" MOVE X"314F00" TO KEY-STATUS *> ALT-O
               WHEN X"315000" MOVE X"315000" TO KEY-STATUS *> ALT-P
               WHEN X"314100" MOVE X"314100" TO KEY-STATUS *> ALT-A
               WHEN X"315300" MOVE X"315300" TO KEY-STATUS *> ALT-S
               WHEN X"314400" MOVE X"314400" TO KEY-STATUS *> ALT-D
               WHEN X"314600" MOVE X"314600" TO KEY-STATUS *> ALT-F
               WHEN X"314700" MOVE X"314700" TO KEY-STATUS *> ALT-G
               WHEN X"314800" MOVE X"314800" TO KEY-STATUS *> ALT-H
               WHEN X"314A00" MOVE X"314A00" TO KEY-STATUS *> ALT-J
               WHEN X"314B00" MOVE X"314B00" TO KEY-STATUS *> ALT-K
               WHEN X"314C00" MOVE X"314C00" TO KEY-STATUS *> ALT-L
               WHEN X"315A00" MOVE X"315A00" TO KEY-STATUS *> ALT-Z
               WHEN X"315800" MOVE X"315800" TO KEY-STATUS *> ALT-X
               WHEN X"314300" MOVE X"314300" TO KEY-STATUS *> ALT-C
               WHEN X"315600" MOVE X"315600" TO KEY-STATUS *> ALT-V
               WHEN X"314200" MOVE X"314200" TO KEY-STATUS *> ALT-B
               WHEN X"314E00" MOVE X"314E00" TO KEY-STATUS *> ALT-N
               WHEN X"314D00" MOVE X"314D00" TO KEY-STATUS *> ALT-M
               WHEN X"310100" MOVE X"310100" TO KEY-STATUS *> F1
               WHEN X"310200" MOVE X"310200" TO KEY-STATUS *> F2
               WHEN X"310300" MOVE X"310300" TO KEY-STATUS *> F3
               WHEN X"310400" MOVE X"310400" TO KEY-STATUS *> F4
               WHEN X"310500" MOVE X"310500" TO KEY-STATUS *> F5
               WHEN X"310600" MOVE X"310600" TO KEY-STATUS *> F6
               WHEN X"310700" MOVE X"310700" TO KEY-STATUS *> F7
               WHEN X"310800" MOVE X"310800" TO KEY-STATUS *> F8
               WHEN X"310900" MOVE X"310900" TO KEY-STATUS *> F9
               WHEN X"310A00" MOVE X"310A00" TO KEY-STATUS *> F10
               WHEN X"321600" MOVE X"320700" TO KEY-STATUS *> HOME
               WHEN X"320C00" MOVE X"320500" TO KEY-STATUS *> UP
               WHEN X"313500" MOVE X"313500" TO KEY-STATUS *> PGUP
               WHEN X"320300" MOVE X"320300" TO KEY-STATUS *> LEFT
               WHEN X"320400" MOVE X"320400" TO KEY-STATUS *> RIGHT
               WHEN X"320A00" MOVE X"320A00" TO KEY-STATUS *> END
               WHEN X"320B00" MOVE X"320600" TO KEY-STATUS *> DOWN
               WHEN X"313600" MOVE X"313600" TO KEY-STATUS *> PGDN  88  PAGE-DOWN
               WHEN X"321700" MOVE X"321700" TO KEY-STATUS *> INSERT
               WHEN X"321100" MOVE X"321100" TO KEY-STATUS *> DELETE
               WHEN X"310B00" MOVE X"310B00" TO KEY-STATUS *> SHIFT-F1
               WHEN X"310C00" MOVE X"310C00" TO KEY-STATUS *> SHIFT-F2
               WHEN X"310D00" MOVE X"310D00" TO KEY-STATUS *> SHIFT-F3
               WHEN X"310E00" MOVE X"310E00" TO KEY-STATUS *> SHIFT-F4
               WHEN X"310F00" MOVE X"310F00" TO KEY-STATUS *> SHIFT-F5
               WHEN X"311000" MOVE X"311000" TO KEY-STATUS *> SHIFT-F6
               WHEN X"311100" MOVE X"311100" TO KEY-STATUS *> SHIFT-F7
               WHEN X"311200" MOVE X"311200" TO KEY-STATUS *> SHIFT-F8
               WHEN X"311300" MOVE X"311300" TO KEY-STATUS *> SHIFT-F9
               WHEN X"311400" MOVE X"311400" TO KEY-STATUS *> SHIFT-F10
               WHEN X"311500" MOVE X"311500" TO KEY-STATUS *> CTRL-F1
               WHEN X"311600" MOVE X"311600" TO KEY-STATUS *> CTRL-F2
               WHEN X"311700" MOVE X"311700" TO KEY-STATUS *> CTRL-F3
               WHEN X"311800" MOVE X"311800" TO KEY-STATUS *> CTRL-F4
               WHEN X"311900" MOVE X"311900" TO KEY-STATUS *> CTRL-F5
               WHEN X"311A00" MOVE X"311A00" TO KEY-STATUS *> CTRL-F6
               WHEN X"311B00" MOVE X"311B00" TO KEY-STATUS *> CTRL-F7
               WHEN X"311C00" MOVE X"311C00" TO KEY-STATUS *> CTRL-F8
               WHEN X"311D00" MOVE X"311D00" TO KEY-STATUS *> CTRL-F9
               WHEN X"311E00" MOVE X"311E00" TO KEY-STATUS *> CTRL-F10
               WHEN X"311F00" MOVE X"311F00" TO KEY-STATUS *> ALT-F1
               WHEN X"312000" MOVE X"312000" TO KEY-STATUS *> ALT-F2
               WHEN X"312100" MOVE X"312100" TO KEY-STATUS *> ALT-F3
               WHEN X"312200" MOVE X"312200" TO KEY-STATUS *> ALT-F4
               WHEN X"312300" MOVE X"312300" TO KEY-STATUS *> ALT-F5
               WHEN X"312400" MOVE X"312400" TO KEY-STATUS *> ALT-F6
               WHEN X"312500" MOVE X"312500" TO KEY-STATUS *> ALT-F7
               WHEN X"312600" MOVE X"312600" TO KEY-STATUS *> ALT-F8
               WHEN X"312700" MOVE X"312700" TO KEY-STATUS *> ALT-F9
               WHEN X"312800" MOVE X"312800" TO KEY-STATUS *> ALT-F10
      *        WHEN X"390900" MOVE X"390900" TO KEY-STATUS *> CTRL-PRTSC
               WHEN X"320900" MOVE X"322700" TO KEY-STATUS *> CTRL-LEFT
               WHEN X"320800" MOVE X"322600" TO KEY-STATUS *> CTRL-RIGHT
               WHEN X"321400" MOVE X"321500" TO KEY-STATUS *> CTRL-END
               WHEN X"313800" MOVE X"313800" TO KEY-STATUS *> CTRL-PGDN
               WHEN X"321600" MOVE X"321600" TO KEY-STATUS *> CTRL-HOME
               WHEN X"312900" MOVE X"312900" TO KEY-STATUS *> ALT-1
               WHEN X"312A00" MOVE X"312A00" TO KEY-STATUS *> ALT-2
               WHEN X"312B00" MOVE X"312B00" TO KEY-STATUS *> ALT-3
               WHEN X"312C00" MOVE X"312C00" TO KEY-STATUS *> ALT-4
               WHEN X"312D00" MOVE X"312D00" TO KEY-STATUS *> ALT-5
               WHEN X"312E00" MOVE X"312E00" TO KEY-STATUS *> ALT-6
               WHEN X"312F00" MOVE X"312F00" TO KEY-STATUS *> ALT-7
               WHEN X"313000" MOVE X"313000" TO KEY-STATUS *> ALT-8
               WHEN X"313100" MOVE X"313100" TO KEY-STATUS *> ALT-9
               WHEN X"313200" MOVE X"313200" TO KEY-STATUS *> ALT-0
               WHEN X"313300" MOVE X"313300" TO KEY-STATUS *> ALT-MINUS
               WHEN X"313400" MOVE X"313400" TO KEY-STATUS *> ALT-EQUAL
               WHEN X"313700" MOVE X"313700" TO KEY-STATUS *> CTRL-PGUP
               WHEN X"315B00" MOVE X"315B00" TO KEY-STATUS *> F11
               WHEN X"315C00" MOVE X"315C00" TO KEY-STATUS *> F12
               WHEN X"315D00" MOVE X"315D00" TO KEY-STATUS *> SHIFT-F11
               WHEN X"315E00" MOVE X"315E00" TO KEY-STATUS *> SHIFT-F12
               WHEN X"315F00" MOVE X"315F00" TO KEY-STATUS *> CTRL-F11
               WHEN X"316000" MOVE X"316000" TO KEY-STATUS *> CTRL-F12
               WHEN X"316100" MOVE X"316100" TO KEY-STATUS *> ALT-F11
               WHEN X"316200" MOVE X"316200" TO KEY-STATUS *> ALT-F12
               WHEN X"390900" MOVE X"390900" TO KEY-STATUS *> CTRL-UP
               WHEN X"390900" MOVE X"390900" TO KEY-STATUS *> CTRL-DOWN
               WHEN X"390900" MOVE X"390900" TO KEY-STATUS *> CTRL-INSERT
               WHEN X"390900" MOVE X"390900" TO KEY-STATUS *> CTRL-DELETE
               WHEN X"390900" MOVE X"390900" TO KEY-STATUS *> CTRL-TAB
           END-EVALUATE.

       000-99-FIM. GOBACK.
       END PROGRAM CWMSMF.
