       WORKING-STORAGE SECTION.
       COPY CWBOXF.cpy.

       LINKAGE SECTION.

       01  PARAMETROS-GRBOXF.
           05 GRBOXF-FUNCTION                PIC  X(001) VALUE "S".
              88 GRBOXF-SHOW                             VALUE "S" "s".
              88 GRBOXF-POP-UP                           VALUE "P" "p".
           05 GRBOXF-PROGRAM                 PIC  X(008) VALUE "......".
           05 GRBOXF-WORK-AREA               PIC  X(050) VALUE SPACES.
           05 GRBOXF-LINE                    PIC  9(002) VALUE 1.
           05 GRBOXF-COLUMN                  PIC  9(002) VALUE 1.
           05 GRBOXF-TYPE                    PIC  9(001) VALUE 0.
           05 GRBOXF-VERTICAL-LENGTH         PIC  9(002) VALUE 0.
           05 GRBOXF-HORIZONTAL-LENGTH       PIC  9(002) VALUE 0.
           05 GRBOXF-OPTION                  PIC  X(040) VALUE SPACE.
           05 GRBOXF-TITLE                   PIC  X(078) VALUE SPACES.
           05 GRBOXF-COLOR-SCREENS    COMP-X PIC  9(002) VALUE 110.
           05 GRBOXF-COLOR-FRAME      COMP-X PIC  9(002) VALUE 110.
           05 GRBOXF-COLOR-SHADE      COMP-X PIC  9(002) VALUE 008.
           05 GRBOXF-COLOR-BARR-MENU  COMP-X PIC  9(002) VALUE 112.
           05 GRBOXF-ORDER                   PIC  9(001) VALUE 0.
           05 GRBOXF-RETURN                  PIC  9(001) VALUE 1.
           05 GRBOXF-STRING-1                PIC  X(040) VALUE SPACES.
           05 GRBOXF-STRING-1-LENGTH         PIC  9(002) VALUE 0.
           05 GRBOXF-STRING-2                PIC  X(040) VALUE SPACES.
           05 GRBOXF-STRING-2-LENGTH         PIC  9(002) VALUE 0.

       PROCEDURE DIVISION USING PARAMETROS-GRBOXF.

           MOVE  GRBOXF-FUNCTION          TO CWBOXF-FUNCTION
           MOVE  GRBOXF-PROGRAM           TO CWBOXF-PROGRAM
           MOVE  GRBOXF-WORK-AREA         TO CWBOXF-WORK-AREA
           MOVE  GRBOXF-LINE              TO CWBOXF-LINE
           MOVE  GRBOXF-COLUMN            TO CWBOXF-COLUMN
           MOVE  GRBOXF-TYPE              TO CWBOXF-TYPE
           MOVE  GRBOXF-VERTICAL-LENGTH   TO CWBOXF-VERTICAL-LENGTH
           MOVE  GRBOXF-HORIZONTAL-LENGTH TO CWBOXF-HORIZONTAL-LENGTH
           MOVE  GRBOXF-OPTION            TO CWBOXF-OPTION
           MOVE  GRBOXF-TITLE             TO CWBOXF-TITLE
           MOVE  GRBOXF-COLOR-SCREENS     TO CWBOXF-COLOR-FRAME
           MOVE  GRBOXF-COLOR-FRAME       TO CWBOXF-COLOR-BORDER
           MOVE  GRBOXF-COLOR-SHADE       TO CWBOXF-COLOR-SHADE
           MOVE  GRBOXF-COLOR-BARR-MENU   TO CWBOXF-COLOR-BARR-MENU
           MOVE  GRBOXF-ORDER             TO CWBOXF-ORDER
           MOVE  GRBOXF-RETURN            TO CWBOXF-RETURN
           MOVE  GRBOXF-STRING-1-LENGTH   TO CWBOXF-STRING-1-LENGTH
           MOVE  GRBOXF-STRING-2-LENGTH   TO CWBOXF-STRING-2-LENGTH
           CALL "CWBOXF" USING PARAMETROS-CWBOXF
           MOVE  CWBOXF-OPTION            TO GRBOXF-OPTION

