       LINKAGE SECTION.

       01  GRECGC-CGC-CIC       COMP-3 PIC  9(014).
       01  GRECGC-CGC-CIC-ED           PIC  X(018).

       PROCEDURE DIVISION USING GRECGC-CGC-CIC GRECGC-CGC-CIC-ED.

           CALL "CWECNP" USING GRECGC-CGC-CIC GRECGC-CGC-CIC-ED.
