       LINKAGE SECTION.

       01  FUNCAO                      PIC  X(001).

       PROCEDURE DIVISION USING FUNCAO.

           CALL "CWIAEF" USING FUNCAO.
