       IDENTIFICATION DIVISION.
       PROGRAM-ID.    XSDBEEP.
       AUTHOR.        COBOLware Services Ltda.
       DATE-WRITTEN.  09/09/2017.
       SECURITY.      *************************************************
                      *                                               *
                      *  Suporte a programas gerados pelo XSEED       *
                      *  Emite sinal sonoro                           *
                      *                                               *
                      *************************************************
       PROCEDURE DIVISION.

           CALL X"E5"
           GOBACK.

       END PROGRAM XSDBEEP.
