       IDENTIFICATION DIVISION.
       PROGRAM-ID.    XSDNUL.
       AUTHOR.        COBOLware Services Ltda.
       DATE-WRITTEN.  09/09/2017.
       SECURITY.      *************************************************
                      *                                               *
                      *  Suporte a programas gerados pelo XSEED       *
                      *  Rotina nula                                  *
                      *                                               *
                      *************************************************
       PROCEDURE DIVISION.

           GOBACK.

       END PROGRAM XSDNUL.
