           IF   INCLUSAO
                EXEC COBOLware OBJECT PUSH-BUTTON SMALL
                          LINE 23 COLUMN 03 WIDTH 09
                          CAPTION " ~Incluir "
                          KEY F3 TAB-OFF
                END-EXEC
           END-IF

           EXEC COBOLware OBJECT PUSH-BUTTON SMALL
                     LINE 23 COLUMN 58 WIDTH 14
                     CAPTION " [esc]-~Fun‡Æo "
                     KEY ESC TAB-OFF
           END-EXEC
