      $Set NoOptional-File
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COBWARET.
       AUTHOR.        COBOLware Services Ltda.
       DATE-WRITTEN.  01/10/2004.
       SECURITY.      *************************************************
                      *                                               *
                      *  Ativa rotinas COBOLware modo TEXTO           *
                      *                                               *
                      *************************************************
       DATA DIVISION.
       PROCEDURE DIVISION.

       000-INICIO.

           GOBACK.

       END PROGRAM COBWARET.

